{
  "backend/main.mo": "Empty Motoko actor placeholder with no methods.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files and components with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend components and config files.",
  "frontend/index.css": "Tailwind base stylesheet defining light/dark OKLCH color tokens and global background/foreground styles.",
  "frontend/index.html": "HTML entry point with SEO metadata, social cards, fonts, and script bootstrap for the React app.",
  "frontend/src/App.tsx": "Main React app composing all marketing sections and layout components.",
  "frontend/src/components/marketing/AboutSection.tsx": "About section showing four feature cards highlighting expertise, products, care, and flexibility.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section with WhatsApp CTA, tel link, and location/availability details inside a styled card.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with branding, navigation links, service list, social icons, and copyright text.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Responsive sticky navbar with logo, smooth-scroll links, mobile menu, and a Book Now button.",
  "frontend/src/components/marketing/Hero.tsx": "Hero section with headline, stats, buttons, and smooth scroll behavior plus a banner image.",
  "frontend/src/components/marketing/Highlights.tsx": "Renders three highlight cards describing parlour, home services, and no extra cost.",
  "frontend/src/components/marketing/ServiceOptionsSection.tsx": "Displays two detailed cards comparing in‑parlour and home service options with feature lists.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Shows a grid of beauty services, each with an icon, title, and description.",
  "frontend/src/components/marketing/WhatsAppCTA.tsx": "WhatsApp button component that opens a prefilled chat using configured phone number and message.",
  "frontend/src/config/whatsapp.ts": "Provides WhatsApp phone number and default message configuration.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, identity persistence, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for future backend-related React Query hooks.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables and theme settings for light and dark modes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including versioning, summary, and a list of implemented features for the beauty parlour website."
}