{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing UI branding and SEO metadata update tasks with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend source files used as reference for build planning.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry with SEO, Open Graph, Twitter metadata, fonts, and branding for Bhagyashree Makeover & Spa.",
  "frontend/src/App.tsx": "Root React component assembling all marketing sections into the main page layout.",
  "frontend/src/components/marketing/AboutSection.tsx": "Marketing section showing four feature cards explaining why users should choose the service.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section featuring WhatsApp CTA, location, availability details, and a styled card layout.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with branding, quick links, services list, social icons, and copyright text.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Responsive sticky header with branding, navigation links, scroll behavior, and mobile menu.",
  "frontend/src/components/marketing/Hero.tsx": "Hero section with headline, stats, image, and scroll-to-services plus WhatsApp CTA.",
  "frontend/src/components/marketing/Highlights.tsx": "Displays three highlight cards for service types using icons and short descriptions.",
  "frontend/src/components/marketing/ServiceOptionsSection.tsx": "Shows two detailed cards comparing in-parlour and home service options with feature lists.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Grid of service cards listing beauty, makeup, hair, skincare, and grooming offerings.",
  "frontend/src/components/marketing/WhatsAppCTA.tsx": "Button component that opens a prefilled WhatsApp chat using configured phone number.",
  "frontend/src/config/whatsapp.ts": "Exports WhatsApp config with phone number placeholder and default prefilled message.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are needed for static content.",
  "frontend/src/index.css": "Tailwind setup defining brand color palette, dark mode values, and global styles.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, and renders the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing a beauty parlour marketing website and listing implemented features like services, WhatsApp CTAs, layout sections, and theme setup."
}